CMS/TicketingLogs/RequestLog27-06-2021-03-05-32.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <ImportTransIntegration xmlns="urn:microsoft-dynamics-schemas/codeunit/LS_Item_Price">
            <importWebSiteData>
                <Loyaltycustomer xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <customerEntryno></customerEntryno>
                    <customerNo></customerNo>
                    <customerContactno></customerContactno>
                    <customerMobileno></customerMobileno>
                    <customerLoyaltycustomer></customerLoyaltycustomer>
                    <customerClubcode></customerClubcode>
                    <customerSchemecode></customerSchemecode>
                    <customerName></customerName>
                    <customerName2></customerName2>
                    <customerAddress></customerAddress>
                    <customerAddress2></customerAddress2>
                    <customerCity></customerCity>
                    <customerCountry></customerCountry>
                    <customerPhoneno></customerPhoneno>
                    <customerEmail></customerEmail>
                    <customerPostcode></customerPostcode>
                </Loyaltycustomer>
                <TransactionHeader xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <headerReceiptNo>WR245722716188</headerReceiptNo>
                    <headerStoreNo>S1001</headerStoreNo>
                    <headerTansactionDate>2021-06-27</headerTansactionDate>
                    <headerTransactionTime>15:05:32</headerTransactionTime>
                    <headerOriginialDate>2021-06-27</headerOriginialDate>
                    <headerNoOfItem>3</headerNoOfItem>
                    <headerNoofItemLines></headerNoofItemLines>
                    <headerMembeCardNo></headerMembeCardNo>
                    <headerCustomerNo></headerCustomerNo>
                    <headerNetAmount>19</headerNetAmount>
                    <headerVATAmount></headerVATAmount>
                    <headerGrossAmount>20</headerGrossAmount>
                    <headerDiscountAmount>1</headerDiscountAmount>
                    <headerTenderType>Online Payment</headerTenderType>
                    <headerPaymentAmount>19</headerPaymentAmount>
					<headerNetPrice>19</headerNetPrice>
                    <TransactionLine>
	<lineReceiptNo>WR245722716188</lineReceiptNo>
	<lineTransDate>2021-06-27</lineTransDate>
	<lineTransTime>15:05:32</lineTransTime>
	<lineNo>10000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000426</lineTicketNo>
	<lineTicketExpiryDate>2021-06-27</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-06-27</lineTicketActivateDate>
	<lineItemNo>1</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>19</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.5</lineDiscountAmount>
	<lineAmount>19</lineAmount>
</TransactionLine><TransactionLine>
	<lineReceiptNo>WR245722716188</lineReceiptNo>
	<lineTransDate>2021-06-27</lineTransDate>
	<lineTransTime>15:05:32</lineTransTime>
	<lineNo>20000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000427</lineTicketNo>
	<lineTicketExpiryDate>2021-06-27</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-06-27</lineTicketActivateDate>
	<lineItemNo>3</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>00.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>19</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount></lineDiscountAmount>
	<lineAmount>19</lineAmount>
</TransactionLine><TransactionLine>
	<lineReceiptNo>WR245722716188</lineReceiptNo>
	<lineTransDate>2021-06-27</lineTransDate>
	<lineTransTime>15:05:32</lineTransTime>
	<lineNo>30000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000428</lineTicketNo>
	<lineTicketExpiryDate>2021-06-27</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-06-27</lineTicketActivateDate>
	<lineItemNo>2</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>19</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.5</lineDiscountAmount>
	<lineAmount>19</lineAmount>
</TransactionLine>
                </TransactionHeader>
            </importWebSiteData>
        </ImportTransIntegration>
    </Body>
</Envelope>
